{
  "search_web": {
    "name": "web_source_discovery",
    "title": "Web Source Discovery",
    "description": "Discovers public web sources using federated queries and relevance ranking for research workflows. Technical reason: improves source coverage and reduces manual source hunting."
  },
  "search_structured": {
    "name": "top_results_synchronizer",
    "title": "Top Results Synchronizer",
    "description": "Runs a query, then synchronizes the top results into a consistent summary payload for quick review. Technical reason: standardizes result triage across providers and formats."
  },
  "scrape_url": {
    "name": "page_content_synchronizer",
    "title": "Page Content Synchronizer",
    "description": "Synchronizes a single page into cleaned text or structured JSON with link context when requested. Technical reason: provides consistent downstream inputs for analysis and note-taking."
  },
  "scrape_batch": {
    "name": "batch_content_sync",
    "title": "Batch Content Sync",
    "description": "Synchronizes many pages in parallel with concurrency control and consistent output formatting. Technical reason: improves throughput while keeping results comparable."
  },
  "crawl_website": {
    "name": "sitemap_structure_analyzer",
    "title": "Sitemap Structure Analyzer",
    "description": "Traverses a site link graph within configured bounds to produce a structured view of pages and relationships. Technical reason: supports architecture analysis and content inventory."
  },
  "extract_structured": {
    "name": "structured_data_extractor",
    "title": "Structured Data Extractor",
    "description": "Extracts user-defined fields from a page into a structured JSON object. Technical reason: enables schema-aligned research capture for repeatable evaluation."
  },
  "research_history": {
    "name": "research_session_index",
    "title": "Research Session Index",
    "description": "Queries prior research artifacts by meaning with configurable recall controls. Technical reason: reduces repeated work by reusing previously synchronized materials."
  },
  "proxy_manager": {
    "name": "network_context_provider",
    "title": "Network Context Provider",
    "description": "Manages regional network endpoints and rotation policies to keep outbound requests stable and observable. Technical reason: improves connectivity consistency for global research."
  },
  "non_robot_search": {
    "name": "non_robot_search",
    "title": "High-Fidelity Web Renderer",
    "description": "Synchronizes content from advanced web applications using a full rendering engine to preserve DOM integrity and JavaScript execution. Technical reason: supports modern frameworks and dynamic navigation where static retrieval is insufficient. Includes deep extraction for lazy-loaded content. Best practice: run requests sequentially when reusing a browser profile to avoid profile lock conflicts.",
    "input_hints": {
      "user_profile_path": "Optional browser profile location for session persistence (sign-in state, preferences). Use with care: sharing a live profile with an already-running browser can cause conflicts.",
      "auto_scroll": "Enable automatic scrolling to trigger lazy-loaded content (images, lists, infinite scroll). Scrolls incrementally down the page, then returns to top. Recommended for LinkedIn, Airbnb, Pinterest, etc.",
      "wait_for_selector": "CSS selector to wait for before extraction (e.g., '.job-listing', '#search-results'). Waits up to 30 seconds for element to appear and become visible.",
      "quality_mode": "balanced (default) = standard wait | aggressive = minimal wait | high = wait for network idle + DOM settling (recommended for lazy-loaded sites)"
    }
  }
}
